Autodesk.Revit.Exceptions.CentralModelIncompatibleRollbackException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.CentralModelIncompatibleRollbackException
The exception thrown when a model's central version has been rolled back.
This leaves the local model incompatible with the central model.